PKS1C/src/DataProcessors/ОбновлениеДоговоров/ОбновлениеДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОбновлениеДоговоров</name>
</mdclass:DataProcessor>

PKS1C/src/InformationRegisters/ДоговораОбслуживания/ДоговораОбслуживания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДоговораОбслуживания</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>АбонентскаяПлата</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТарифСверхурочный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЧерныйСписок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

PKS1C/src/Documents/ДоговорОбслуживания/ДоговорОбслуживания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДоговорОбслуживания</name>
  <registerRecords>InformationRegister.ДоговораОбслуживания</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>АбонентскаяПлата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТарифСверхурочный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧерныйСписок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

PKS1C/src/DataProcessors/ОбновлениеДоговоров/Forms/Форма/Module.bsl
&НаСервере
Процедура ЗаполнитьНаСервере(перем_ТабЗнач, Месяц)
	Месяц = КонецДня(Месяц);
	перем_ТабЗнач.Очистить();
	
	ЗапросДоговоров = Новый Запрос;
	ЗапросДоговоров.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Контрагенты.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТКонтрагенты
		|ИЗ
		|	Справочник.Клиенты КАК Клиенты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		|		ПО Клиенты.Контрагент = Контрагенты.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоговораОбслуживанияСрезПоследних.Контрагент КАК Контрагент,
		|	МАКСИМУМ(ДоговораОбслуживанияСрезПоследних.Период) КАК Дата
		|ПОМЕСТИТЬ ВТДаты
		|ИЗ
		|	РегистрСведений.ДоговораОбслуживания.СрезПоследних(&Дата, ) КАК ДоговораОбслуживанияСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	ДоговораОбслуживанияСрезПоследних.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЕСТЬNULL(ДоговораОбслуживания.АбонентскаяПлата, ЛОЖЬ) КАК АбонентскаяПлата,
		|	ЕСТЬNULL(ДоговораОбслуживания.Тариф, 0) КАК Тариф,
		|	ЕСТЬNULL(ДоговораОбслуживания.Период, ""Без договора"") КАК Дата,
		|	ЕСТЬNULL(ДоговораОбслуживания.ТарифСверхурочный, ""Без договора"") КАК ТарифСверхурочный,
		|	ВТКонтрагенты.Ссылка КАК Контрагент
		|ИЗ
		|	ВТКонтрагенты КАК ВТКонтрагенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДоговораОбслуживания КАК ДоговораОбслуживания
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДаты КАК ВТДаты
		|			ПО ДоговораОбслуживания.Период = ВТДаты.Дата
		|		ПО ДоговораОбслуживания.Контрагент = ВТКонтрагенты.Ссылка";
	
	ЗапросДоговоров.УстановитьПараметр("Дата", Месяц);
	
	РезультатЗапросаДоговоров = ЗапросДоговоров.Выполнить();
	
	ВыборкаДоговоров = РезультатЗапросаДоговоров.Выбрать();
	
	Пока ВыборкаДоговоров.Следующий() Цикл
		Стр = перем_ТабЗнач.Добавить();                 
		Стр.ДатаДоговора = Формат(ВыборкаДоговоров.Дата, "ДФ=""дд.ММ.гггг");
		Стр.Контрагент = ВыборкаДоговоров.Контрагент;
		Стр.ТекущийТариф = ВыборкаДоговоров.Тариф;
		Стр.ТекущийТарифСверхурочный = ВыборкаДоговоров.ТарифСверхурочный;
		Стр.Абонент = ВыборкаДоговоров.АбонентскаяПлата;
	КонецЦикла;
	
	КопироватьДанныеФормы(перем_ТабЗнач, ТабЗнач);
	Сообщить("Заполнение завершено!");
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	перем_ТабЗнач = ТабЗнач;
	ЗаполнитьНаСервере(перем_ТабЗнач, МесяцСтарыхДоговоров);
КонецПроцедуры

&НаСервере
Процедура СоздатьНаСервере(ТабЗнач, Месяц, Действие)
	Месяц = НачалоДня(Месяц);
		
	Для Каждого ТекСтрока Из ТабЗнач Цикл		
		Если ТекСтрока.НовыйТариф = 0 Тогда	
			Если Действие = 0 Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;

		Договор = Документы.ДоговорОбслуживания.СоздатьДокумент();
		Договор.Дата = Месяц;
		Договор.Контрагент = ТекСтрока.Контрагент;
		Договор.АбонентскаяПлата = ТекСтрока.Абонент;
		Договор.Тариф = ТекСтрока.НовыйТариф;
		Договор.ТарифСверхурочный = ТекСтрока.НовыйТарифСверхурочный;
		
		Попытка
			Договор.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		КонецПопытки;	
	КонецЦикла;
	Сообщить("Договоры созданы!");
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
	Действие = 2;
	Для Каждого ТекСтрока Из ТабЗнач Цикл		
		Если ТекСтрока.НовыйТариф = 0 Тогда	
			ВызванаФорма = Истина;
			Действие = ОткрытьФормуМодально("Обработка.ОбновлениеДоговоров.Форма.Ошибка");
			Если Действие = 1 Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		Прервать;
	КонецЦикла;
	перем_ТабЗнач = ТабЗнач;
	СоздатьНаСервере(перем_ТабЗнач, МесяцНовыхДоговоров, Действие);
КонецПроцедуры

&НаКлиенте
Процедура МесяцНовыхДоговоровНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	МесяцНовыхДоговоров = ОткрытьФормуМодально("Обработка.ВыпадающийВыборПериода.Форма.Форма2");
КонецПроцедуры

&НаКлиенте
Процедура МесяцСтарыхДоговоровНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	МесяцСтарыхДоговоров = ОткрытьФормуМодально("Обработка.ВыпадающийВыборПериода.Форма.Форма2");
КонецПроцедуры

&НаСервере
Процедура КопироватьДоговораНаСервере(перем_ТабЗнач)
	Для Каждого ТекСтрока Из перем_ТабЗнач Цикл		
		ТекСтрока.НовыйТариф = ТекСтрока.ТекущийТариф;
		ТекСтрока.НовыйТарифСверхурочный = ТекСтрока.ТекущийТарифСверхурочный;
	КонецЦикла;
	
	КопироватьДанныеФормы(перем_ТабЗнач, ТабЗнач);
	Сообщить("Договоры скопированы!");
КонецПроцедуры

&НаКлиенте
Процедура КопироватьДоговора(Команда)
	перем_ТабЗнач = ТабЗнач;
	КопироватьДоговораНаСервере(перем_ТабЗнач);
КонецПроцедуры
